<details><summary>tf plan:</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/wspieramprzyrode/app/runs/run-uMXsZAK1fC6uPers

Waiting for the plan to start...

Terraform v0.12.25
Configuring remote state backend...
Initializing Terraform configuration...
2020/05/21 20:11:35 [DEBUG] Using modified User-Agent: Terraform/0.12.25 TFC/c6d59bd658
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

cloudflare_zone.dns_zone: Refreshing state... [id=e7a0b3ef45073d63cf619df176888e35]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.docs_dns_record will be created
  + resource "cloudflare_record" "docs_dns_record" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docs"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 3600
      + type        = "CNAME"
      + value       = "wspieramprzyrode.github.io"
      + zone_id     = "e7a0b3ef45073d63cf619df176888e35"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>